Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/goormdotcom/prod/runs/run-k7waMLaBGT78r9RA

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.rds_payment.aws_db_parameter_group.this: Refreshing state... [id=payment-pg-16]
module.ecr_user.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/user-service]
module.ecr_payment.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_product.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/product-service]
module.rds_product.aws_db_parameter_group.this: Refreshing state... [id=product-pg-16]
module.ecr_order.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/order-service]
module.rds_user.aws_db_parameter_group.this: Refreshing state... [id=user-pg-16]
module.rds_order.aws_db_parameter_group.this: Refreshing state... [id=order-pg-16]
module.common_network.aws_vpc.goorm: Refreshing state... [id=vpc-05849d37708e8d04b]
module.ecr_product.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/product-service]
module.ecr_payment.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_order.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/order-service]
module.ecr_user.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/user-service]
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refresh complete after 0s [id=3726282990]
module.ecr_policy_user.data.aws_iam_policy_document.push: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.push: Refresh complete after 0s [id=1624808761]
module.ecr_policy_user.aws_iam_policy.pull: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-pull]
module.ecr_policy_user.aws_iam_policy.push: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-push]
module.common_network.aws_network_acl.private_db: Refreshing state... [id=acl-0c08493f66d453539]
module.common_network.aws_network_acl.private_app: Refreshing state... [id=acl-02cbcd2a240674c25]
module.common_network.aws_internet_gateway.igw: Refreshing state... [id=igw-0e15d27caf5d04488]
module.common_network.aws_subnet.private-db-2: Refreshing state... [id=subnet-0510549f3411c9d6b]
module.common_network.aws_route_table.private_app: Refreshing state... [id=rtb-021321f668dab3076]
module.common_network.aws_subnet.public: Refreshing state... [id=subnet-09ad4d9343cfb64c7]
module.common_network.aws_route_table.public: Refreshing state... [id=rtb-06bc322b3beb2c260]
module.common_network.aws_subnet.private-app: Refreshing state... [id=subnet-039f40894ea2007f2]
module.common_network.aws_route_table.private_db: Refreshing state... [id=rtb-05d66dc5419563992]
module.common_network.aws_subnet.private-db: Refreshing state... [id=subnet-05a8605bf45055418]
module.targetgroup_user.aws_lb_target_group.this["tg-user-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-1/f8159236aae5bc1e]
module.targetgroup_user.aws_lb_target_group.this["tg-user-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-2/58b11f15cd4e71e3]
module.targetgroup_payment.aws_lb_target_group.this["tg-payment-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-1/e3b3583300f5d98e]
module.targetgroup_payment.aws_lb_target_group.this["tg-payment-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-2/405f81a33a3435c6]
module.security.aws_security_group.rds_user: Refreshing state... [id=sg-0c32e1ec713957804]
module.security.aws_security_group.rds_payment: Refreshing state... [id=sg-0613fe7cffbbed089]
module.targetgroup_product.aws_lb_target_group.this["tg-product-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-1/e43bc2c185041f9b]
module.targetgroup_product.aws_lb_target_group.this["tg-product-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-2/ee8471d7a37b7031]
module.targetgroup_order.aws_lb_target_group.this["tg-order-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-1/16e1c1748d8d8679]
module.targetgroup_order.aws_lb_target_group.this["tg-order-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-2/99a9bcf62ac70f7c]
module.security.aws_security_group.rds_order: Refreshing state... [id=sg-01500a61cef193bc6]
module.security.aws_security_group.rds_product: Refreshing state... [id=sg-0f9265b7ebd7016e2]
module.common_network.aws_network_acl_rule.private_db_ingress_allow_vpc: Refreshing state... [id=nacl-4266145329]
module.common_network.aws_network_acl_rule.private_db_egress_allow_vpc: Refreshing state... [id=nacl-2621490983]
module.common_network.aws_network_acl_rule.private_app_egress_allow_vpc: Refreshing state... [id=nacl-853482340]
module.common_network.aws_network_acl_rule.private_app_ingress_allow_vpc: Refreshing state... [id=nacl-288602567]
module.common_network.aws_route.public_internet: Refreshing state... [id=r-rtb-06bc322b3beb2c2601080289494]
module.common_network.aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-01b60d178019c2bc8]
module.common_network.aws_network_acl_association.private_app_assoc: Refreshing state... [id=aclassoc-036001ac34e6596a5]
module.common_network.aws_route_table_association.private_app_assoc: Refreshing state... [id=rtbassoc-0259d5da3d4635a2b]
module.common_network.aws_route_table_association.private_db_assoc: Refreshing state... [id=rtbassoc-06401706b781b7a9c]
module.common_network.aws_network_acl_association.private_db_assoc: Refreshing state... [id=aclassoc-0b99aba58abc1609f]
module.rds_order.aws_db_subnet_group.this: Refreshing state... [id=order-db-subnet-group]
module.rds_user.aws_db_subnet_group.this: Refreshing state... [id=user-db-subnet-group]
module.rds_product.aws_db_subnet_group.this: Refreshing state... [id=product-db-subnet-group]
module.rds_payment.aws_db_subnet_group.this: Refreshing state... [id=payment-db-subnet-group]
module.rds_order.aws_db_instance.this: Refreshing state... [id=order]
module.rds_user.aws_db_instance.this: Refreshing state... [id=user]
module.rds_product.aws_db_instance.this: Refreshing state... [id=product]
module.rds_payment.aws_db_instance.this: Refreshing state... [id=payment]
module.common_network.aws_network_acl.private_app: Drift detected (update)
module.common_network.aws_route_table.public: Drift detected (update)
module.common_network.aws_network_acl.private_db: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nlb.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                              = (known after apply)
      + arn_suffix                       = (known after apply)
      + dns_name                         = (known after apply)
      + enable_cross_zone_load_balancing = false
      + enable_deletion_protection       = false
      + id                               = (known after apply)
      + internal                         = true
      + ip_address_type                  = (known after apply)
      + load_balancer_type               = "network"
      + name                             = "goorm-nlb"
      + security_groups                  = (known after apply)
      + subnets                          = [
          + "subnet-039f40894ea2007f2",
        ]
      + tags_all                         = (known after apply)
      + vpc_id                           = (known after apply)
      + zone_id                          = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.nlb.aws_lb_listener.order_1 will be created
  + resource "aws_lb_listener" "order_1" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 82
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-1/16e1c1748d8d8679"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.order_2 will be created
  + resource "aws_lb_listener" "order_2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 182
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-2/99a9bcf62ac70f7c"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.payment_1 will be created
  + resource "aws_lb_listener" "payment_1" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 83
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-1/e3b3583300f5d98e"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.payment_2 will be created
  + resource "aws_lb_listener" "payment_2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 183
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-2/405f81a33a3435c6"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.product_1 will be created
  + resource "aws_lb_listener" "product_1" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 81
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-1/e43bc2c185041f9b"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.product_2 will be created
  + resource "aws_lb_listener" "product_2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 181
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-2/ee8471d7a37b7031"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.user_1 will be created
  + resource "aws_lb_listener" "user_1" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-1/f8159236aae5bc1e"
          + type             = "forward"
        }
    }

  # module.nlb.aws_lb_listener.user_2 will be created
  + resource "aws_lb_listener" "user_2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 180
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-2/58b11f15cd4e71e3"
          + type             = "forward"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 5 of 11 estimated
           $318.0399999999998976/mo +$16.2

<!-- Sticky Pull Request Commentterraform-plan -->